#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.5`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hZTFjOWZiMy03YmM5LTQ0MDMtYjM5MS1hZWJmYTA2NGJlMWU7b2JqZWN0SWQ9N2I1NzNmOWEtM2EyOC00OWM3LWI3NTUtNjUwMjBmNTA4OGU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0][0m
[0m[1mdata.azurerm_location.current: Read complete after 3s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/locations/germanywestcentral][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_kusto_cluster" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azurerm_data_factory.data_factory[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory" "data_factory" {
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "germanywestcentral"
      [32m+[0m[0m managed_virtual_network_enabled = true
      [32m+[0m[0m name                            = "tsde-int-df001"
      [32m+[0m[0m public_network_enabled          = true
      [32m+[0m[0m resource_group_name             = "tsde-int-dataeng-rg"

      [32m+[0m[0m github_configuration {
          [32m+[0m[0m account_name       = "PerfectThymeTech"
          [32m+[0m[0m branch_name        = "main"
          [32m+[0m[0m git_url            = "https://github.com"
          [32m+[0m[0m publishing_enabled = true
          [32m+[0m[0m repository_name    = "timeseries-data-explorer"
          [32m+[0m[0m root_folder        = "/code/datafactory"
        }

      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "happinessThreshold"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "0.8"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumLift"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "5.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumNumberOfUsersPerWindow"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "10.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumPlays"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "20.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumUsersRatio"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "0.1"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "movingWindowInMinutes"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "30.0"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # azurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoint_kusto_cluster[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_managed_private_endpoint" "data_factory_managed_private_endpoint_kusto_cluster" {
      [32m+[0m[0m data_factory_id    = (known after apply)
      [32m+[0m[0m fqdns              = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "AzureDataExplorer"
      [32m+[0m[0m subresource_name   = "cluster"
      [32m+[0m[0m target_resource_id = (known after apply)
    }

[1m  # azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "germanywestcentral"
      [32m+[0m[0m name                            = "tsde-int-vault001"
      [32m+[0m[0m public_network_access_enabled   = true
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "tsde-int-dataeng-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Allow"
        }
    }

[1m  # azurerm_kusto_cluster.kusto_cluster[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_cluster" "kusto_cluster" {
      [32m+[0m[0m allowed_fqdns                      = []
      [32m+[0m[0m allowed_ip_ranges                  = []
      [32m+[0m[0m auto_stop_enabled                  = false
      [32m+[0m[0m data_ingestion_uri                 = (known after apply)
      [32m+[0m[0m disk_encryption_enabled            = true
      [32m+[0m[0m double_encryption_enabled          = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m location                           = "germanywestcentral"
      [32m+[0m[0m name                               = "tsde-int-kusto001"
      [32m+[0m[0m outbound_network_access_restricted = true
      [32m+[0m[0m public_ip_type                     = "IPv4"
      [32m+[0m[0m public_network_access_enabled      = true
      [32m+[0m[0m purge_enabled                      = false
      [32m+[0m[0m resource_group_name                = "tsde-int-dataeng-rg"
      [32m+[0m[0m streaming_ingestion_enabled        = false
      [32m+[0m[0m trusted_external_tenants           = []
      [32m+[0m[0m uri                                = (known after apply)
      [32m+[0m[0m zones                              = [
          [32m+[0m[0m "1",
          [32m+[0m[0m "2",
          [32m+[0m[0m "3",
        ]

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m language_extensions {
          [32m+[0m[0m image = "Python3_10_8"
          [32m+[0m[0m name  = "PYTHON"
        }

      [32m+[0m[0m sku {
          [32m+[0m[0m capacity = 2
          [32m+[0m[0m name     = "Standard_E2ads_v5"
        }
    }

[1m  # azurerm_kusto_database.kusto_database["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database" "kusto_database" {
      [32m+[0m[0m cluster_name        = "tsde-int-kusto001"
      [32m+[0m[0m hot_cache_period    = "P7D"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "germanywestcentral"
      [32m+[0m[0m name                = "operationaldb"
      [32m+[0m[0m resource_group_name = "tsde-int-dataeng-rg"
      [32m+[0m[0m size                = (known after apply)
      [32m+[0m[0m soft_delete_period  = "P31D"
    }

[1m  # azurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_admin["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database_principal_assignment" "data_factory_kusto_database_principal_assignment_admin" {
      [32m+[0m[0m cluster_name        = "tsde-int-kusto001"
      [32m+[0m[0m database_name       = "operationaldb"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "operationaldb-Admin-tsde-int-df001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m principal_name      = (known after apply)
      [32m+[0m[0m principal_type      = "App"
      [32m+[0m[0m resource_group_name = "tsde-int-dataeng-rg"
      [32m+[0m[0m role                = "Admin"
      [32m+[0m[0m tenant_id           = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m tenant_name         = (known after apply)
    }

[1m  # azurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_ingestor["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database_principal_assignment" "data_factory_kusto_database_principal_assignment_ingestor" {
      [32m+[0m[0m cluster_name        = "tsde-int-kusto001"
      [32m+[0m[0m database_name       = "operationaldb"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "operationaldb-Ingestor-tsde-int-df001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m principal_name      = (known after apply)
      [32m+[0m[0m principal_type      = "App"
      [32m+[0m[0m resource_group_name = "tsde-int-dataeng-rg"
      [32m+[0m[0m role                = "Ingestor"
      [32m+[0m[0m tenant_id           = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m tenant_name         = (known after apply)
    }

[1m  # azurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_viewer["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database_principal_assignment" "data_factory_kusto_database_principal_assignment_viewer" {
      [32m+[0m[0m cluster_name        = "tsde-int-kusto001"
      [32m+[0m[0m database_name       = "operationaldb"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "operationaldb-Viewer-tsde-int-df001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m principal_name      = (known after apply)
      [32m+[0m[0m principal_type      = "App"
      [32m+[0m[0m resource_group_name = "tsde-int-dataeng-rg"
      [32m+[0m[0m role                = "Viewer"
      [32m+[0m[0m tenant_id           = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m tenant_name         = (known after apply)
    }

[1m  # azurerm_kusto_script.kusto_script["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_script" "kusto_script" {
      [32m+[0m[0m continue_on_errors_enabled         = false
      [32m+[0m[0m database_id                        = (known after apply)
      [32m+[0m[0m force_an_update_when_value_changed = "Ly8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCi8vIENyZWF0ZSBpbmdlc3QgdGFibGVzCi8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLwoKLmNyZWF0ZS1tZXJnZSB0YWJsZXMKICAgIG90dF9pbmdlc3QoCiAgICAgICAgQ291bnRyeTogc3RyaW5nLAogICAgICAgIFNlcnZpY2U6IHN0cmluZywKICAgICAgICBTZXJ2aWNlVHlwZTogc3RyaW5nLAogICAgICAgIERldmljZTogc3RyaW5nLAogICAgICAgIFRpdGxlOiBzdHJpbmcsCiAgICAgICAgSXNwOiBzdHJpbmcsCiAgICAgICAgQ2RuSG9zdG5hbWU6IHN0cmluZywKICAgICAgICBDZG5Qb3A6IHN0cmluZywKICAgICAgICBBcHBSZWxlYXNlVmVyc2lvbjogc3RyaW5nLAogICAgICAgIEJyb3dzZXI6IHN0cmluZywKICAgICAgICBPczogc3RyaW5nLAogICAgICAgIFBsYXllcjogc3RyaW5nLAogICAgICAgIEhhcHBpbmVzc1Njb3JlOiByZWFsLAogICAgICAgIFVzZXJJZDogc3RyaW5nLAogICAgICAgIEVuZFRpbWU6IGRhdGV0aW1lLAogICAgICAgIEhhc2g6IHN0cmluZwogICAgKSwKICAgIGlwdHZfaW5nZXN0KAogICAgICAgIENvdW50cnk6IHN0cmluZywKICAgICAgICBTZXJ2aWNlOiBzdHJpbmcsCiAgICAgICAgU2VydmljZVR5cGU6IHN0cmluZywKICAgICAgICBUb3BvbG9neTI6IHN0cmluZywKICAgICAgICBUb3BvbG9neTM6IHN0cmluZywKICAgICAgICBUb3BvbG9neTQ6IHN0cmluZywKICAgICAgICBUb3BvbG9neTU6IHN0cmluZywKICAgICAgICBUaXRsZTogc3RyaW5nLAogICAgICAgIFN0Yk1vZGVsOiBzdHJpbmcsCiAgICAgICAgU3RiTWFudWZhY3R1cmVyOiBzdHJpbmcsCiAgICAgICAgU3RiU3dWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgU3RyZWFtaW5nUHJvdG9jb2w6IHN0cmluZywKICAgICAgICBDZG5Ib3N0bmFtZTogc3RyaW5nLAogICAgICAgIENkblBvcDogc3RyaW5nLAogICAgICAgIENoYW5uZWxOYW1lOiBzdHJpbmcsCiAgICAgICAgSGFwcGluZXNzU2NvcmU6IHJlYWwsCiAgICAgICAgVXNlcklkOiBzdHJpbmcsCiAgICAgICAgRW5kVGltZTogZGF0ZXRpbWUsCiAgICAgICAgSGFzaDogc3RyaW5nCiAgICApCgovLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8KLy8gQ3JlYXRlIHJhdyB0YWJsZXMKLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCgouY3JlYXRlLW1lcmdlIHRhYmxlcwogICAgb3R0X3JhdygKICAgICAgICBDb3VudHJ5OiBzdHJpbmcsCiAgICAgICAgU2VydmljZTogc3RyaW5nLAogICAgICAgIFNlcnZpY2VUeXBlOiBzdHJpbmcsCiAgICAgICAgRGV2aWNlOiBzdHJpbmcsCiAgICAgICAgVGl0bGU6IHN0cmluZywKICAgICAgICBJc3A6IHN0cmluZywKICAgICAgICBDZG5Ib3N0bmFtZTogc3RyaW5nLAogICAgICAgIENkblBvcDogc3RyaW5nLAogICAgICAgIEFwcFJlbGVhc2VWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgQnJvd3Nlcjogc3RyaW5nLAogICAgICAgIE9zOiBzdHJpbmcsCiAgICAgICAgUGxheWVyOiBzdHJpbmcsCiAgICAgICAgSGFwcGluZXNzU2NvcmU6IHJlYWwsCiAgICAgICAgVXNlcklkOiBzdHJpbmcsCiAgICAgICAgRW5kVGltZTogZGF0ZXRpbWUsCiAgICAgICAgSGFzaDogc3RyaW5nCiAgICApLAogICAgaXB0dl9yYXcoCiAgICAgICAgQ291bnRyeTogc3RyaW5nLAogICAgICAgIFNlcnZpY2U6IHN0cmluZywKICAgICAgICBTZXJ2aWNlVHlwZTogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5Mjogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5Mzogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5NDogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5NTogc3RyaW5nLAogICAgICAgIFRpdGxlOiBzdHJpbmcsCiAgICAgICAgU3RiTW9kZWw6IHN0cmluZywKICAgICAgICBTdGJNYW51ZmFjdHVyZXI6IHN0cmluZywKICAgICAgICBTdGJTd1ZlcnNpb246IHN0cmluZywKICAgICAgICBTdHJlYW1pbmdQcm90b2NvbDogc3RyaW5nLAogICAgICAgIENkbkhvc3RuYW1lOiBzdHJpbmcsCiAgICAgICAgQ2RuUG9wOiBzdHJpbmcsCiAgICAgICAgQ2hhbm5lbE5hbWU6IHN0cmluZywKICAgICAgICBIYXBwaW5lc3NTY29yZTogcmVhbCwKICAgICAgICBVc2VySWQ6IHN0cmluZywKICAgICAgICBFbmRUaW1lOiBkYXRldGltZSwKICAgICAgICBIYXNoOiBzdHJpbmcKICAgICkKCi8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLwovLyBDcmVhdGUgY3VyYXRlZCB0YWJsZXMKLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCgouY3JlYXRlLW1lcmdlIHRhYmxlcwogICAgb3R0X2hhcHBpbmVzcygKICAgICAgICBDb3VudHJ5OiBzdHJpbmcsCiAgICAgICAgU2VydmljZTogc3RyaW5nLAogICAgICAgIFNlcnZpY2VUeXBlOiBzdHJpbmcsCiAgICAgICAgRGV2aWNlOiBzdHJpbmcsCiAgICAgICAgVGl0bGU6IHN0cmluZywKICAgICAgICBJc3A6IHN0cmluZywKICAgICAgICBDZG5Ib3N0bmFtZTogc3RyaW5nLAogICAgICAgIENkblBvcDogc3RyaW5nLAogICAgICAgIEFwcFJlbGVhc2VWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgQnJvd3Nlcjogc3RyaW5nLAogICAgICAgIE9zOiBzdHJpbmcsCiAgICAgICAgUGxheWVyOiBzdHJpbmcsCiAgICAgICAgQXZnSGFwcGluZXNzU2NvcmU6IHJlYWwsCiAgICAgICAgTnVtYmVyT2ZVc2VyczogbG9uZywKICAgICAgICBUaW1lc3RhbXA6IGRhdGV0aW1lCiAgICApLAogICAgaXB0dl9oYXBwaW5lc3MoCiAgICAgICAgQ291bnRyeTogc3RyaW5nLAogICAgICAgIFNlcnZpY2U6IHN0cmluZywKICAgICAgICBTZXJ2aWNlVHlwZTogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5Mjogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5Mzogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5NDogc3RyaW5nLAogICAgICAgIFRvcG9sb2d5NTogc3RyaW5nLAogICAgICAgIFRpdGxlOiBzdHJpbmcsCiAgICAgICAgU3RiTW9kZWw6IHN0cmluZywKICAgICAgICBTdGJNYW51ZmFjdHVyZXI6IHN0cmluZywKICAgICAgICBTdGJTd1ZlcnNpb246IHN0cmluZywKICAgICAgICBTdHJlYW1pbmdQcm90b2NvbDogc3RyaW5nLAogICAgICAgIENkbkhvc3RuYW1lOiBzdHJpbmcsCiAgICAgICAgQ2RuUG9wOiBzdHJpbmcsCiAgICAgICAgQ2hhbm5lbE5hbWU6IHN0cmluZywKICAgICAgICBBdmdIYXBwaW5lc3NTY29yZTogcmVhbCwKICAgICAgICBOdW1iZXJPZlVzZXJzOiBsb25nLAogICAgICAgIFRpbWVzdGFtcDogZGF0ZXRpbWUKICAgICkKCi8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLwovLyBDcmVhdGUgaGVscGVyIHRhYmxlcwovLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8KCi5jcmVhdGUtbWVyZ2UgdGFibGVzCiAgICB0aHJlc2hvbGRzICgKICAgICAgICBuYW1lOiBzdHJpbmcsCiAgICAgICAgdmFsdWU6IHJlYWwsCiAgICAgICAgdGltZXN0YW1wOiBkYXRldGltZQogICAgKQoKLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCi8vIENyZWF0ZSBmdW5jdGlvbgovLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIGZvciBPVFQgdXBkYXRlIHBvbGljeScsIGZvbGRlcj0nb3R0JykgT3R0VXBkYXRlUG9saWN5KCkgewogICAgb3R0X2luZ2VzdAogICAgfCBqb2luIGtpbmQ9bGVmdGFudGkgaGludC5zaHVmZmxla2V5PUNvdW50cnkgb3R0X3JhdyBvbiAkbGVmdC5IYXNoID09ICRyaWdodC5IYXNoIGFuZCAkbGVmdC5Db3VudHJ5ID09ICRyaWdodC5Db3VudHJ5Cn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIGZvciBJUFRWIHVwZGF0ZSBwb2xpY3knLCBmb2xkZXI9J2lwdHYnKSBJcHR2VXBkYXRlUG9saWN5KCkgewogICAgaXB0dl9pbmdlc3QKICAgIHwgam9pbiBraW5kPWxlZnRhbnRpIGhpbnQuc2h1ZmZsZWtleT1Db3VudHJ5IGlwdHZfcmF3IG9uICRsZWZ0Lkhhc2ggPT0gJHJpZ2h0Lkhhc2ggYW5kICRsZWZ0LkNvdW50cnkgPT0gJHJpZ2h0LkNvdW50cnkKfQoKLmNyZWF0ZS1vci1hbHRlciBmdW5jdGlvbiB3aXRoIChkb2NzdHJpbmcgPSAnRnVuY3Rpb24gdG8gZ2V0IGxhdGVzdCB0aHJlc2hvbGQgdmFsdWUgZm9yIG5hbWVkIHRocmVzaG9sZCcsIGZvbGRlcj0ndGhyZXNob2xkcycpIEdldFRocmVzaG9sZCh2YWx1ZU5hbWU6IHN0cmluZykgewogICAgdG9zY2FsYXIoCiAgICAgICAgdGhyZXNob2xkcwogICAgICAgIHwgd2hlcmUgbmFtZSA9PSB2YWx1ZU5hbWUKICAgICAgICB8IG9yZGVyIGJ5IHRpbWVzdGFtcCBkZXNjCiAgICAgICAgfCBsaW1pdCAxCiAgICAgICAgfCBzdW1tYXJpemUgbWF4KHZhbHVlKQogICAgKQp9CgouY3JlYXRlLW9yLWFsdGVyIGZ1bmN0aW9uIHdpdGggKGRvY3N0cmluZyA9ICdGdW5jdGlvbiB0byBnZXQgYXZlcmFnZSBoYXBwaW5lc3Mgc2NvcmVzIGZvciBpcHR2IGRhdGEnLCBmb2xkZXI9J2lwdHYnKSBJcHR2R2V0QXZnSGFwcGluZXNzU2NvcmUodGltZXN0YW1wOiBzdHJpbmcpIHsKICAgIGxldCBjdXJyZW50VGltZXN0YW1wID0gdG9kYXRldGltZSh0aW1lc3RhbXApOwogICAgbGV0IG1vdmluZ1dpbmRvd0luTWludXRlcyA9IHRvaW50KEdldFRocmVzaG9sZCgnbW92aW5nV2luZG93SW5NaW51dGVzJykpOwogICAgbGV0IHN0YXJ0VGltZXN0YW1wID0gZGF0ZXRpbWVfYWRkKCdtaW51dGUnLCAtbW92aW5nV2luZG93SW5NaW51dGVzLCBjdXJyZW50VGltZXN0YW1wKTsKICAgIGlwdHZfcmF3CiAgICB8IHdoZXJlIEVuZFRpbWUgYmV0d2VlbiAoc3RhcnRUaW1lc3RhbXAgLi4gY3VycmVudFRpbWVzdGFtcCkKICAgIHwgc3VtbWFyaXplCiAgICAgICAgQXZnSGFwcGluZXNzU2NvcmUgPSBhdmcoSGFwcGluZXNzU2NvcmUpLAogICAgICAgIE51bWJlck9mVXNlcnMgPSBkY291bnQoVXNlcklkKSwKICAgICAgICBUaW1lc3RhbXAgPSBjdXJyZW50VGltZXN0YW1wCiAgICAgICAgYnkKICAgICAgICBDb3VudHJ5LAogICAgICAgIFNlcnZpY2UsCiAgICAgICAgU2VydmljZVR5cGUsCiAgICAgICAgVG9wb2xvZ3kyLAogICAgICAgIFRvcG9sb2d5MywKICAgICAgICBUb3BvbG9neTQsCiAgICAgICAgVG9wb2xvZ3k1LAogICAgICAgIFRpdGxlLAogICAgICAgIFN0Yk1vZGVsLAogICAgICAgIFN0Yk1hbnVmYWN0dXJlciwKICAgICAgICBTdGJTd1ZlcnNpb24sCiAgICAgICAgU3RyZWFtaW5nUHJvdG9jb2wsCiAgICAgICAgQ2RuSG9zdG5hbWUsCiAgICAgICAgQ2RuUG9wLAogICAgICAgIENoYW5uZWxOYW1lCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIHRvIGdldCBhdmVyYWdlIGhhcHBpbmVzcyBzY29yZXMgZm9yIG90dCBkYXRhJywgZm9sZGVyPSdvdHQnKSBPdHRHZXRBdmdIYXBwaW5lc3NTY29yZSh0aW1lc3RhbXA6IHN0cmluZykgewogICAgbGV0IGN1cnJlbnRUaW1lc3RhbXAgPSB0b2RhdGV0aW1lKHRpbWVzdGFtcCk7CiAgICBsZXQgbW92aW5nV2luZG93SW5NaW51dGVzID0gdG9pbnQoR2V0VGhyZXNob2xkKCdtb3ZpbmdXaW5kb3dJbk1pbnV0ZXMnKSk7CiAgICBsZXQgc3RhcnRUaW1lc3RhbXAgPSBkYXRldGltZV9hZGQoJ21pbnV0ZScsIC1tb3ZpbmdXaW5kb3dJbk1pbnV0ZXMsIGN1cnJlbnRUaW1lc3RhbXApOwogICAgb3R0X3JhdwogICAgfCB3aGVyZSBFbmRUaW1lIGJldHdlZW4gKHN0YXJ0VGltZXN0YW1wIC4uIGN1cnJlbnRUaW1lc3RhbXApCiAgICB8IHN1bW1hcml6ZQogICAgICAgIEF2Z0hhcHBpbmVzc1Njb3JlID0gYXZnKEhhcHBpbmVzc1Njb3JlKSwKICAgICAgICBOdW1iZXJPZlVzZXJzID0gZGNvdW50KFVzZXJJZCksCiAgICAgICAgVGltZXN0YW1wID0gY3VycmVudFRpbWVzdGFtcAogICAgICAgIGJ5CiAgICAgICAgQ291bnRyeSwKICAgICAgICBTZXJ2aWNlLAogICAgICAgIFNlcnZpY2VUeXBlLAogICAgICAgIERldmljZSwKICAgICAgICBUaXRsZSwKICAgICAgICBJc3AsCiAgICAgICAgQ2RuSG9zdG5hbWUsCiAgICAgICAgQ2RuUG9wLAogICAgICAgIEFwcFJlbGVhc2VWZXJzaW9uLAogICAgICAgIEJyb3dzZXIsCiAgICAgICAgT3MsCiAgICAgICAgUGxheWVyCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIHRvIGdldCBhdmVyYWdlIGhhcHBpbmVzcyBzY29yZXMgZm9yIG90dCBkYXRhIGZvciBvbmUgY29sdW1uJywgZm9sZGVyPSdvdHQnKSBPdHRHZXRBdmdIYXBwaW5lc3NTY29yZUZvck9uZUNvbHVtbihjb2x1bW5OYW1lOiBzdHJpbmcpIHsKICAgIG90dF9oYXBwaW5lc3MKICAgIHwgZXh0ZW5kIFRvdGFsSGFwcGluZXNzID0gTnVtYmVyT2ZVc2VycyAqIEF2Z0hhcHBpbmVzc1Njb3JlCiAgICB8IHN1bW1hcml6ZQogICAgICAgIFN1bVRvdGFsSGFwcGluZXNzID0gc3VtKFRvdGFsSGFwcGluZXNzKSwKICAgICAgICBTdW1OdW1iZXJPZlVzZXJzID0gc3VtKE51bWJlck9mVXNlcnMpCiAgICAgICAgYnkKICAgICAgICBUaW1lc3RhbXAsCiAgICAgICAgY29sdW1uX2lmZXhpc3RzKGNvbHVtbk5hbWUsICdjb2x1bW5OYW1lIGRvZXMgbm90IGV4aXN0JykKICAgIHwgZXh0ZW5kIEF2Z0hhcHBpbmVzc1Njb3JlID0gU3VtVG90YWxIYXBwaW5lc3MgLyBTdW1OdW1iZXJPZlVzZXJzCiAgICB8IHByb2plY3QtYXdheSBTdW1Ub3RhbEhhcHBpbmVzcwp9CgouY3JlYXRlLW9yLWFsdGVyIGZ1bmN0aW9uIHdpdGggKGRvY3N0cmluZyA9ICdGdW5jdGlvbiB0byBnZXQgYXZlcmFnZSBoYXBwaW5lc3Mgc2NvcmVzIGZvciBvdHQgZGF0YSBmb3IgdHdvIGNvbHVtbnMnLCBmb2xkZXI9J290dCcpIE90dEdldEF2Z0hhcHBpbmVzc1Njb3JlRm9yVHdvQ29sdW1ucyhjb2x1bW5OYW1lMTogc3RyaW5nLCBjb2x1bW5OYW1lMjogc3RyaW5nKSB7CiAgICBvdHRfaGFwcGluZXNzCiAgICB8IGV4dGVuZCBUb3RhbEhhcHBpbmVzcyA9IE51bWJlck9mVXNlcnMgKiBBdmdIYXBwaW5lc3NTY29yZQogICAgfCBzdW1tYXJpemUKICAgICAgICBTdW1Ub3RhbEhhcHBpbmVzcyA9IHN1bShUb3RhbEhhcHBpbmVzcyksCiAgICAgICAgU3VtTnVtYmVyT2ZVc2VycyA9IHN1bShOdW1iZXJPZlVzZXJzKQogICAgICAgIGJ5CiAgICAgICAgVGltZXN0YW1wLAogICAgICAgIGNvbHVtbl9pZmV4aXN0cyhjb2x1bW5OYW1lMSwgJ2NvbHVtbk5hbWUxIGRvZXMgbm90IGV4aXN0JyksCiAgICAgICAgY29sdW1uX2lmZXhpc3RzKGNvbHVtbk5hbWUyLCAnY29sdW1uTmFtZTIgZG9lcyBub3QgZXhpc3QnKQogICAgfCBleHRlbmQgQXZnSGFwcGluZXNzU2NvcmUgPSBTdW1Ub3RhbEhhcHBpbmVzcyAvIFN1bU51bWJlck9mVXNlcnMKICAgIHwgcHJvamVjdC1hd2F5IFN1bVRvdGFsSGFwcGluZXNzCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIHRvIGdldCBhdmVyYWdlIGhhcHBpbmVzcyBzY29yZXMgZm9yIGlwdHYgZGF0YSBmb3Igb25lIGNvbHVtbicsIGZvbGRlcj0naXB0dicpIElwdHZHZXRBdmdIYXBwaW5lc3NTY29yZUZvck9uZUNvbHVtbihjb2x1bW5OYW1lOiBzdHJpbmcpIHsKICAgIGlwdHZfaGFwcGluZXNzCiAgICB8IGV4dGVuZCBUb3RhbEhhcHBpbmVzcyA9IE51bWJlck9mVXNlcnMgKiBBdmdIYXBwaW5lc3NTY29yZQogICAgfCBzdW1tYXJpemUKICAgICAgICBTdW1Ub3RhbEhhcHBpbmVzcyA9IHN1bShUb3RhbEhhcHBpbmVzcyksCiAgICAgICAgU3VtTnVtYmVyT2ZVc2VycyA9IHN1bShOdW1iZXJPZlVzZXJzKQogICAgICAgIGJ5CiAgICAgICAgVGltZXN0YW1wLAogICAgICAgIGNvbHVtbl9pZmV4aXN0cyhjb2x1bW5OYW1lLCAnY29sdW1uTmFtZSBkb2VzIG5vdCBleGlzdCcpCiAgICB8IGV4dGVuZCBBdmdIYXBwaW5lc3NTY29yZSA9IFN1bVRvdGFsSGFwcGluZXNzIC8gU3VtTnVtYmVyT2ZVc2VycwogICAgfCBwcm9qZWN0LWF3YXkgU3VtVG90YWxIYXBwaW5lc3MKfQoKLmNyZWF0ZS1vci1hbHRlciBmdW5jdGlvbiB3aXRoIChkb2NzdHJpbmcgPSAnRnVuY3Rpb24gdG8gZ2V0IGF2ZXJhZ2UgaGFwcGluZXNzIHNjb3JlcyBmb3IgaXB0diBkYXRhIGZvciB0d28gY29sdW1ucycsIGZvbGRlcj0naXB0dicpIElwdHZHZXRBdmdIYXBwaW5lc3NTY29yZUZvclR3b0NvbHVtbnMoY29sdW1uTmFtZTE6IHN0cmluZywgY29sdW1uTmFtZTI6IHN0cmluZykgewogICAgaXB0dl9oYXBwaW5lc3MKICAgIHwgZXh0ZW5kIFRvdGFsSGFwcGluZXNzID0gTnVtYmVyT2ZVc2VycyAqIEF2Z0hhcHBpbmVzc1Njb3JlCiAgICB8IHN1bW1hcml6ZQogICAgICAgIFN1bVRvdGFsSGFwcGluZXNzID0gc3VtKFRvdGFsSGFwcGluZXNzKSwKICAgICAgICBTdW1OdW1iZXJPZlVzZXJzID0gc3VtKE51bWJlck9mVXNlcnMpCiAgICAgICAgYnkKICAgICAgICBUaW1lc3RhbXAsCiAgICAgICAgY29sdW1uX2lmZXhpc3RzKGNvbHVtbk5hbWUxLCAnY29sdW1uTmFtZTEgZG9lcyBub3QgZXhpc3QnKSwKICAgICAgICBjb2x1bW5faWZleGlzdHMoY29sdW1uTmFtZTIsICdjb2x1bW5OYW1lMiBkb2VzIG5vdCBleGlzdCcpCiAgICB8IGV4dGVuZCBBdmdIYXBwaW5lc3NTY29yZSA9IFN1bVRvdGFsSGFwcGluZXNzIC8gU3VtTnVtYmVyT2ZVc2VycwogICAgfCBwcm9qZWN0LWF3YXkgU3VtVG90YWxIYXBwaW5lc3MKfQoKLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCi8vIENyZWF0ZSB1cGRhdGUgcG9saWNpZXMKLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCgouYWx0ZXIgdGFibGUgb3R0X3JhdyBwb2xpY3kgdXBkYXRlCkAnW3sgIklzRW5hYmxlZCI6IHRydWUsICJTb3VyY2UiOiAib3R0X2luZ2VzdCIsICJRdWVyeSI6ICJPdHRVcGRhdGVQb2xpY3koKSIsICJJc1RyYW5zYWN0aW9uYWwiOiB0cnVlLCAiUHJvcGFnYXRlSW5nZXN0aW9uUHJvcGVydGllcyI6IGZhbHNlfV0nCgouYWx0ZXItbWVyZ2UgdGFibGUgb3R0X2luZ2VzdCBwb2xpY3kgcmV0ZW50aW9uIHNvZnRkZWxldGUgPSAwczsKCi5hbHRlciB0YWJsZSBpcHR2X3JhdyBwb2xpY3kgdXBkYXRlCkAnW3sgIklzRW5hYmxlZCI6IHRydWUsICJTb3VyY2UiOiAiaXB0dl9pbmdlc3QiLCAiUXVlcnkiOiAiSXB0dlVwZGF0ZVBvbGljeSgpIiwgIklzVHJhbnNhY3Rpb25hbCI6IHRydWUsICJQcm9wYWdhdGVJbmdlc3Rpb25Qcm9wZXJ0aWVzIjogZmFsc2V9XScKCi5hbHRlci1tZXJnZSB0YWJsZSBpcHR2X2luZ2VzdCBwb2xpY3kgcmV0ZW50aW9uIHNvZnRkZWxldGUgPSAwczsKCi8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLwovLyBDcmVhdGUgbWF0ZXJpYWxpemVkIHZpZXdzCi8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLwoKLy8gQ3JlYXRlIG1hdGVyYWxpemVkIHZpZXcKLmNyZWF0ZSBpZm5vdGV4aXN0cyBtYXRlcmlhbGl6ZWQtdmlldyB3aXRoIChkb2NTdHJpbmc9J0lQVFYgSGFwcGluZXNzIFNjb3JlIEF2ZXJhZ2UnLCBmb2xkZXI9J2lwdHYnKSBpcHR2X2hhcHBpbmVzc19tdiBvbiB0YWJsZSBpcHR2X3JhdyB7CiAgICBpcHR2X3JhdwogICAgfCBzdW1tYXJpemUKICAgICAgICBBdmdIYXBwaW5lc3NTY29yZSA9IGF2ZyhIYXBwaW5lc3NTY29yZSksCiAgICAgICAgTnVtYmVyT2ZVc2VycyA9IGRjb3VudChVc2VySWQpCiAgICAgICAgYnkKICAgICAgICBDb3VudHJ5LAogICAgICAgIFNlcnZpY2UsCiAgICAgICAgU2VydmljZVR5cGUsCiAgICAgICAgVG9wb2xvZ3kyLAogICAgICAgIFRvcG9sb2d5MywKICAgICAgICBUb3BvbG9neTQsCiAgICAgICAgVG9wb2xvZ3k1LAogICAgICAgIFRpdGxlLAogICAgICAgIFN0Yk1vZGVsLAogICAgICAgIFN0Yk1hbnVmYWN0dXJlciwKICAgICAgICBTdGJTd1ZlcnNpb24sCiAgICAgICAgU3RyZWFtaW5nUHJvdG9jb2wsCiAgICAgICAgQ2RuSG9zdG5hbWUsCiAgICAgICAgQ2RuUG9wLAogICAgICAgIENoYW5uZWxOYW1lCn0KCi5jcmVhdGUgaWZub3RleGlzdHMgbWF0ZXJpYWxpemVkLXZpZXcgd2l0aCAoZG9jU3RyaW5nPSdPVFQgSGFwcGluZXNzIFNjb3JlIEF2ZXJhZ2UnLCBmb2xkZXI9J290dCcpIG90dF9oYXBwaW5lc3NfbXYgb24gdGFibGUgb3R0X3JhdyB7CiAgICBvdHRfcmF3CiAgICB8IHN1bW1hcml6ZQogICAgICAgIEF2Z0hhcHBpbmVzc1Njb3JlID0gYXZnKEhhcHBpbmVzc1Njb3JlKSwKICAgICAgICBOdW1iZXJPZlVzZXJzID0gZGNvdW50KFVzZXJJZCkKICAgICAgICBieQogICAgICAgIENvdW50cnksCiAgICAgICAgU2VydmljZSwKICAgICAgICBTZXJ2aWNlVHlwZSwKICAgICAgICBEZXZpY2UsCiAgICAgICAgVGl0bGUsCiAgICAgICAgSXNwLAogICAgICAgIENkbkhvc3RuYW1lLAogICAgICAgIENkblBvcCwKICAgICAgICBBcHBSZWxlYXNlVmVyc2lvbiwKICAgICAgICBCcm93c2VyLAogICAgICAgIE9zLAogICAgICAgIFBsYXllcgp9CgovLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8KLy8gQ3JlYXRlIHZpZXdzCi8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLwoKLmNyZWF0ZS1vci1hbHRlciBmdW5jdGlvbiB3aXRoICh2aWV3PXRydWUsIGRvY3N0cmluZz0nVmlldyB0byBjYXB0dXJlIGNyaXRpY2FsIGlwdHYgaXRlbXMgYmVsb3cgdGhlIGhhcHBpbmVzcyB0aHJlc2hvbGQnLCBmb2xkZXI9J2lwdHYnKSBpcHR2X2hhcHBpbmVzc19jcml0aWNhbF9tdiB7CiAgICBpcHR2X2hhcHBpbmVzc19tdgogICAgfCB3aGVyZSBBdmdIYXBwaW5lc3NTY29yZSA8IEdldFRocmVzaG9sZCgnaGFwcGluZXNzJykgYW5kIE51bWJlck9mVXNlcnMgPiBHZXRUaHJlc2hvbGQoJ21pbmltdW1OdW1iZXJPZlVzZXJzUGVyV2luZG93JykKfQoKLmNyZWF0ZS1vci1hbHRlciBmdW5jdGlvbiB3aXRoICh2aWV3PXRydWUsIGRvY3N0cmluZz0nVmlldyB0byBjYXB0dXJlIGNyaXRpY2FsIG90dCBpdGVtcyBiZWxvdyB0aGUgaGFwcGluZXNzIHRocmVzaG9sZCcsIGZvbGRlcj0nb3R0Jykgb3R0X2hhcHBpbmVzc19jcml0aWNhbF9tdiB7CiAgICBvdHRfaGFwcGluZXNzX212CiAgICB8IHdoZXJlIEF2Z0hhcHBpbmVzc1Njb3JlIDwgR2V0VGhyZXNob2xkKCdoYXBwaW5lc3MnKSBhbmQgTnVtYmVyT2ZVc2VycyA+IEdldFRocmVzaG9sZCgnbWluaW11bU51bWJlck9mVXNlcnNQZXJXaW5kb3cnKQp9Cg=="
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m name                               = "init-db-operationaldb"
      [32m+[0m[0m script_content                     = (sensitive value)
    }

[1m  # azurerm_resource_group.resource_group_dataeng[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_dataeng" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "germanywestcentral"
      [32m+[0m[0m name     = "tsde-int-dataeng-rg"
    }

[1m  # azurerm_resource_group.resource_group_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_storage" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "germanywestcentral"
      [32m+[0m[0m name     = "tsde-int-stg-rg"
    }

[1m  # azurerm_role_assignment.current_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_key_vault" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "7b573f9a-3a28-49c7-b755-65020f5088e5"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.current_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_storage" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "7b573f9a-3a28-49c7-b755-65020f5088e5"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.data_factory_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "data_factory_role_assignment_key_vault" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.data_factory_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "data_factory_role_assignment_storage" {
      [32m+[0m[0m condition_version                = (known after apply)
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_storage_account.storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage" {
      [32m+[0m[0m access_tier                        = "Hot"
      [32m+[0m[0m account_kind                       = "StorageV2"
      [32m+[0m[0m account_replication_type           = "ZRS"
      [32m+[0m[0m account_tier                       = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public    = false
      [32m+[0m[0m allowed_copy_scope                 = "AAD"
      [32m+[0m[0m cross_tenant_replication_enabled   = false
      [32m+[0m[0m default_to_oauth_authentication    = true
      [32m+[0m[0m dns_endpoint_type                  = "Standard"
      [32m+[0m[0m https_traffic_only_enabled         = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled  = true
      [32m+[0m[0m is_hns_enabled                     = true
      [32m+[0m[0m large_file_share_enabled           = false
      [32m+[0m[0m local_user_enabled                 = true
      [32m+[0m[0m location                           = "germanywestcentral"
      [32m+[0m[0m min_tls_version                    = "TLS1_2"
      [32m+[0m[0m name                               = "tsdeintstg001"
      [32m+[0m[0m nfsv3_enabled                      = false
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string     = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint              = (known after apply)
      [32m+[0m[0m primary_blob_host                  = (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_connection_string          = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint               = (known after apply)
      [32m+[0m[0m primary_dfs_host                   = (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [32m+[0m[0m primary_file_endpoint              = (known after apply)
      [32m+[0m[0m primary_file_host                  = (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_location                   = (known after apply)
      [32m+[0m[0m primary_queue_endpoint             = (known after apply)
      [32m+[0m[0m primary_queue_host                 = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_table_endpoint             = (known after apply)
      [32m+[0m[0m primary_table_host                 = (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_web_endpoint               = (known after apply)
      [32m+[0m[0m primary_web_host                   = (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [32m+[0m[0m public_network_access_enabled      = true
      [32m+[0m[0m queue_encryption_key_type          = "Account"
      [32m+[0m[0m resource_group_name                = "tsde-int-stg-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
      [32m+[0m[0m sftp_enabled                       = false
      [32m+[0m[0m shared_access_key_enabled          = false
      [32m+[0m[0m table_encryption_key_type          = "Account"

      [32m+[0m[0m blob_properties {
          [32m+[0m[0m change_feed_enabled      = false
          [32m+[0m[0m default_service_version  = "2020-06-12"
          [32m+[0m[0m last_access_time_enabled = false
          [32m+[0m[0m versioning_enabled       = false

          [32m+[0m[0m container_delete_retention_policy {
              [32m+[0m[0m days = 7
            }

          [32m+[0m[0m delete_retention_policy {
              [32m+[0m[0m days                     = 7
              [32m+[0m[0m permanent_delete_enabled = false
            }
        }

      [32m+[0m[0m network_rules {
          [32m+[0m[0m bypass                     = [
              [32m+[0m[0m "None",
            ]
          [32m+[0m[0m default_action             = "Allow"
          [32m+[0m[0m ip_rules                   = (known after apply)
          [32m+[0m[0m virtual_network_subnet_ids = (known after apply)

          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Security/datascanners/storageDataScanner"
              [32m+[0m[0m endpoint_tenant_id   = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
            }
        }

      [32m+[0m[0m queue_properties (known after apply)

      [32m+[0m[0m routing {
          [32m+[0m[0m choice                      = "MicrosoftRouting"
          [32m+[0m[0m publish_internet_endpoints  = false
          [32m+[0m[0m publish_microsoft_endpoints = false
        }

      [32m+[0m[0m share_properties (known after apply)

      [32m+[0m[0m static_website (known after apply)
    }

[1m  # azurerm_storage_container.storage_container["curated"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "curated"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "tsdeintstg001"
    }

[1m  # azurerm_storage_container.storage_container["logs"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "logs"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "tsdeintstg001"
    }

[1m  # azurerm_storage_container.storage_container["raw"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "raw"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "tsdeintstg001"
    }

[1m  # azurerm_storage_container.storage_container["upload-iptv"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "upload-iptv"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "tsdeintstg001"
    }

[1m  # azurerm_storage_container.storage_container["upload-ott"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "upload-ott"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "tsdeintstg001"
    }

[1m  # time_sleep.sleep_kusto_db["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_kusto_db" {
      [32m+[0m[0m create_duration = "240s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 22 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with azurerm_storage_container.storage_container["raw"],
[33m│[0m [0m  on datalake.tf line 59, in resource "azurerm_storage_container" "storage_container":
[33m│[0m [0m  59:   storage_account_name = [4mazurerm_storage_account.storage.name[0m[0m
[33m│[0m [0m
[33m│[0m [0mthe `storage_account_name` property has been deprecated in favour of
[33m│[0m [0m`storage_account_id` and will be removed in version 5.0 of the Provider.
[33m│[0m [0m
[33m│[0m [0m(and 4 more similar warnings elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>